[
    {
        "url": "https://www.pcguide.com/motherboard/guide/best-x670-motherboards/",
        "content": "Best X670 motherboards in 2024\nCamilo Delgado\nPC Guide is reader-supported. When you buy through links on our site, we may earn an affiliate commission. [Read More](https://www.pcguide.com/earnings-disclaimer/)\n\n#### Table of Contents\n\n*   [Products at a Glance](#products-at-a-glance)\n*   [How we picked the best X670 motherboards](#how-we-picked-the-best-x670-motherboards)\n*   [Product Reviews](#product-reviews)\n\n*   [MSI Pro X670-P WIFI](#msi-pro-x670-p-wifi)\n*   [Asus Prime X670-P WiFi](#asus-prime-x670-p-wifi)\n*   [ASUS ROG Crosshair X670E Extreme](#asus-rog-crosshair-x670e-extreme)\n*   [ASUS ROG Strix X670E-I Gaming WiFi](#asus-rog-strix-x670e-i-gaming-wifi)\n\n*   [Features and considerations](#features-and-considerations)\n\n*   [Overclocking](#overclocking)\n*   [Form factor](#form-factor)\n*   [Cooling](#cooling)\n\n*   [Our Verdict](#our-verdict)\n\nAMD prides itself on its exclusiveness. The brand has paved its own path, building a fanbase more prominent than many others. For years, its CPUs have been known to be well-suited for gaming and overclocking.\n\nThe [AMD 7000 series](https://www.pcguide.com/cpu/where-to-buy-ryzen-7000-cpus/) goes far and beyond any other previous AMD CPU, made all the more powerful alongside the new X670 and X670E mobos, which are here to improve the way we see, feel and live within the gaming world. These are the new 600-series motherboards that will support Ryzen 7000 series CPUs.\n\nIn this post, we’ll show you the best X670 motherboards so your new AMD processor can shine."
    },
    {
        "url": "https://www.techspot.com/bestof/amd-x670-motherboards/",
        "content": "The Best AMD X670E Motherboards\nSteven Walton\nOver the past few months we've been gathering as many AMD X670 motherboards as we could to test their VRM performance and to see if they can all handle the [Ryzen 9 7950X](https://www.techspot.com/review/2535-amd-ryzen-7950x/) without any kind of thermal throttling, something we ran into with a number of [X570 motherboards](https://www.techspot.com/bestof/amd-x570-motherboards/) a few years ago.\n\nIt's taken a tremendous amount of time, but we now have basically every single X670 and X670E motherboard, all said and done we've tested 22 boards: 4 from Asrock, 4 from Gigabyte, 4 from MSI and 10 from Asus (not sure why but Asus has so many more boards than others), but that's the situation.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-25.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-25-jpg)\n\nAsus is the only brand to offer a Mini-ITX X670E board, and they're also the only brand to also offer a MicroATX X670E board. So that means we have one Mini-ITX, one MicroATX and 20 ATX boards on hand.\n\nUsually we'd go over each motherboard, talk about the key features, the heatsinks, and the VRM components, but we've got 22 boards, so spending a few minutes on each one isn't all that interesting for this roundup. Instead we'll jump straight into VRM thermal testing, then brush over a spec comparison table, before making some actual board recommendations, so let's get into it.\n\nTest System and Notes\n---------------------\n\nLet's talk about test conditions first. For this testing we've built a dedicated system inside the Corsair iCUE 7000X case. Powering it we have the HX1000 power supply and for cooling the Corsair iCUE H170i Elite Capellix.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-24.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-24-jpg)\n\nThe iCUE 7000X has been configured with a single rear 140mm exhaust fan and three 140mm intake fans, which is the stock configuration for this case. At the top of the case is the H170i 420mm radiator with three 140mm exhaust fans. This is a pretty high-end configuration, airflow is good and in a 21 degree room we'd say this is an optimal setup.\n\nFor recording temperatures we're using a digital thermometer with K-Type thermocouples and we'll be reporting the peak rear PCB temperature. Finally, we're not reporting Delta-T over Ambient, instead I maintain a room temperature of 21 degrees and to ensure a consistent ambient temperature a thermocouple is positioned next to the test system.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-19.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-19-jpg)\n\nNormally, as part of this test, we'd test a range of CPUs to see how the boards handle varying loads, but with all X670 boards bordering on overkill when it comes to their VRM design, we've simply used the [Ryzen 9 7950X](https://www.techspot.com/review/2535-amd-ryzen-7950x/) for all testing.\n\nFor the stress test, we're using [Cinebench R23](https://www.techspot.com/downloads/6709-cinebench.html) looped for an hour, at which point we're reporting the maximum PCB temperature recorded using the k-type thermocouples.\n\nAnd well, the good news is you don't have to worry about VRM thermals with X670 boards, not even a little. In the past, we've seen boards that should perform well fail miserably in this testing, but that's not the case here...\n\n[~![](https://www.techspot.com/articles-info/2621/bench/2023-02-07-image.png)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-png)\n\nA few things to note. Any temperature below 80c is to be considered very cool, VRM temps only start to become a concern when they exceed 90c, and even then there's still 10-20c worth of headroom before most boards will thermal throttle. Below 80c is very safe and will never present an issue, so all X670 boards are well within safe limits.\n\nWe should also stress that there's no difference between a board running at 56c and one at 67 or even 76c, performance will be identical assuming the same operating parameters – frequency and timings. Therefore, you wouldn't say purchase the Aorus Master over the Taichi because the Gigabyte board's VRM ran 4c cooler.\n\nThat said, if two products occupy the same price point, but one runs significantly cooler than the other, that could be a reason to buy one over the other. For example, the [Gigabyte X670 Aorus Elite AX](https://www.amazon.com/GIGABYTE-X670-AORUS-AX-Motherboard/dp/B0BF7FT26Z/?tag=httpwwwtechsp-20) ran at just 57c and at $290 shares the same price tag as the [Asus Prime X670-P WiFi](https://www.amazon.com/ASUS-X670-P-Motherboard-Type-C%C2%AE-Ethernet/dp/B0BDTLXWQM/?tag=httpwwwtechsp-20) which ran at a very satisfactory 66c, so everything else being equal, we'd recommend the Aorus Elite AX.\n\nAlso, for those of you wondering why we didn't bother overclocking the 7950X to increase VRM load, we thought this would be pointless as all boards will easily handle an overclocked 7950X and most of you are probably far more interested in undervolting AM5 processors than you are overclocking.\n\nAll said and done, VRM thermals are not a concern for X670 shoppers. Instead potential buyers should focus on pricing and features, so let's do that...\n\n$300 or Less: Best Budget X670E Motherboards\n--------------------------------------------\n\nFor those of you looking at spending $300 or less on an X670 motherboard, there are over half a dozen options. The most affordable one is the [Asrock X670E PG Lightning](https://www.amazon.com/ASRock-X670E-PG-Processors-Motherboard/dp/B0BGPH2LQJ/?tag=httpwwwtechsp-20) and it also happens to be an X670 Extreme motherboard. As far as entry-level X670 motherboards go, the Asrock X670E PG Lightning and [Gigabyte X670 Gaming X](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fp%2F1HD-0002-00218) are in our opinion the best options.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-3.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-3-jpg)\n\nThe [MSI Pro X670-P WiFi](https://www.amazon.com/MSI-X670-P-ProSeries-Motherboard-Wi-Fi/dp/B0B6Q1N477/?tag=httpwwwtechsp-20) is also decent, but doesn't do anything to justify a price premium over the Gaming X. The Pro X670-P WiFi is also priced to compete with [Asrock's X670E Pro RS](https://www.amazon.com/ASRock-X670E-PRO-RS-Motherboard/dp/B0BGPCNSGZ/?tag=httpwwwtechsp-20) which is another 'Extreme' board offering PCIe 5.0 to the primary PCIe slot along with the primary M.2 slot.\n\nYou also get a pre-installed I/O shield with the Pro RS and an upgradable M.2 WiFi 6E support. The MSI board has a better VRM on paper, but in reality a degree celsius separated them using the 7950X.\n\n$300 - $350: Best Mainstream X670E Boards\n-----------------------------------------\n\nFrom $300 to $350 there are three options from Asus and Asrock. The [Asrock X670E Steel Legend](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fasrock-x670e-steel-legend%2Fp%2FN82E16813162070) comes in at $300, the [Asus TUF Gaming X670E-Plus WiFi](https://www.amazon.com/ASUS-TUF-X670E-PLUS-Motherboard-Lighting/dp/B0BDTJFHKJ/?tag=httpwwwtechsp-20) at $330 and then the [Asus Prime X670E-Pro WiFi](https://www.amazon.com/ASUS-X670E-PRO-Motherboard-Type-C%C2%AE-Ethernet/dp/B0BF6VKQP4/?tag=httpwwwtechsp-20) at $350.\n\nThe X670E TUF Gaming and X670E Prime are basically the same product, the Prime just gets an extra M.2 heatsink, onboard buttons for power and reset, an easy to access release for the PCIe retention mechanism and better RGB lighting, hard to say if all that's worth an extra $20 though.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-4.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-4-jpg)\n\nIn terms of value the Steel Legend offers basically everything you'll find on the TUF Gaming, so at $30 less it's a good deal and at a $50 saving from the Prime Pro is probably the better option there is as well. Unless Asus can get the Prime Pro within $20 of the Steel Legend, we'd just go with the Asrock board.\n\n$400 to $500: Best Mainstream X670E Boards\n------------------------------------------\n\nPricing jumps up to $420 for the [Asus ROG Strix X670E-A Gaming](https://www.amazon.com/ASUS-ROG-X670E-Motherboard-Cooling/dp/B0BDV6RR2K/?tag=httpwwwtechsp-20), $440 for the [Asus ROG Strix X670E-F Gaming](https://www.amazon.com/ASUS-ROG-X670E-F-Motherboard-heatsinks/dp/B0BDTK4SLH/?tag=httpwwwtechsp-20) and then $480 for the [MSI MPG X670E Carbon](https://www.amazon.com/MSI-X670E-Carbon-Gaming-Motherboard/dp/B0B6Q23SPC/?tag=httpwwwtechsp-20).\n\nThere's also the $460 [Asus ROG Strix X670E-I Gaming](https://www.amazon.com/ASUS-STRIX-X670E-I-GAMING-WIFI/dp/B0BDTVCJF8/?tag=httpwwwtechsp-20), but that's an ITX board, and it's the only X670E ITX board you will find, so if you want an ITX board with AMD's flagship chipset then it goes without saying, you'd buy this one.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-7.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-7-jpg)\n\nThe ROG Strix X670E-I Gaming is an impressive ITX board, using ten 110A power stages for the vcore it ran very cool and although it features active cooling it was always silent in our testing. Admittedly, we tested it under the same conditions as all the other boards, so in a cramped ITX case it will likely run a bit hotter, but we're confident it's up to the task.\n\nYou also get USB4 support, 10 USB ports on the I/O panel, high quality external audio, two M.2 ports, 2.5 Gbit LAN and WiFi 6E, so it's a super well equipped ITX motherboard, but of course it's not exactly cheap.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-6.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-6-jpg)\n\nAs for the Strix X670E-A and Strix X670E-F, these are essentially the same motherboards with different styling. The 'F' is an all-black design with a stealthy look, while the 'A' features a lot of white and silver elements, mostly on the board's heatsinks.\n\nIn terms of pricing, the 'A' which costs $20 less is the best value option, but if you want that stealthy look then you'll have to cough up the extra cash for the 'F'.\n\nAlternatively, there's the [MSI X670E Carbon](https://www.amazon.com/MSI-X670E-Carbon-Gaming-Motherboard/dp/B0B6Q23SPC/?tag=httpwwwtechsp-20) which costs even more at $480 and the main reason for spending more on this board is to receive PCIe 5.0 support for the primary and secondary PCIe x16 slots, along with the primary and secondary M.2 slots. Of course, when using both of these devices the bandwidth is halved, which isn't an issue if using PCIe 5.0 hardware, but it's a bit of a problem for PCIe 4.0 devices.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-9.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-9-jpg)\n\nStill, if you were to use PCIe 5.0 devices this configuration would make the most sense, as both delivers would receive x8 PCIe 5.0 bandwidth which is 32 GB/s. In comparison the Asus ROG Strix X670E-F Gaming connects its secondary PCIe x16 slot chipset, which is a lot cheaper to wire in, but does limit you to PCIe 4.0 x4 bandwidth (8 GB/s).\n\nEssentially both boards have the same amount of PCIe bandwidth, the Carbon can just better spread that bandwidth across multiple slots while almost 90% of the PCIe bandwidth of the F Gaming is eaten up by the primary PCIe 5.0 x16 slot.\n\nSo we guess you could argue that the Carbon is a more future-proof motherboard that will support future generations of AM5 hardware better, but whether or not that's worth paying a $40-60 premium now is hard to say, but it is the most affordable X670E motherboard to offer this configuration – the Asus ROG Strix X670E-E Gaming is only $20 more, offers the same PCIe configuration, an extra PCIe 5.0 M.2 slot and more USB 3.2 ports.\n\n$500 to $700: Best High-End X670E Boards\n----------------------------------------\n\nThe next price range starts at $500 which opens us up to not just the [Asus ROG Strix X670E-E Gaming](https://www.amazon.com/ASUS-ROG-Motherboard-Q-Release-Q-Latch/dp/B0BDTHQTJV/?tag=httpwwwtechsp-20), but also the [Gigabyte X670E Aorus Master](https://www.amazon.com/GIGABYTE-X670E-AORUS-Warranty-Motherboard/dp/B0BF7CL99N/?tag=httpwwwtechsp-20) and [Asrock X670E Taichi](https://www.amazon.com/ASRock-X670E-Support-Processors-Motherboard/dp/B0BGPF7K2P/?tag=httpwwwtechsp-20).\n\nThere's also the [Asus ROG Crosshair X670E Gene](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fasus-rog-crosshair-x670e-gene%2Fp%2FN82E16813119583R) for $510 but that's a MicroATX motherboard, the only mATX X670 board, so like the ITX version, it kind of just wins by default if you want a MicroATX X670 motherboard, and of course it's an X670E version.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-10.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-10-jpg)\n\nIt's an extreme motherboard as well, the 16 teamed 110A powerstage vcore VRM is no joke, there's two PCIe 5.0 M.2 slots, USB4 support, loads of USB ports, onboard buttons, debug LED codes, 2.5 Gbit LAN and WiFi 6, it's an impressive but also ultra expensive mATX motherboard.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-11.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-11-jpg)\n\nAs for the other three options, we think the least impressive is the X670E Aorus Master, at $500 it's not a significant upgrade over the Aorus Elite AX despite costing a little over 70% more, which is obviously a significant cost increase.\n\nOf course, it is an X670 Extreme board so you get PCIe 5.0 for the primary PCIe slot, which is nice, there's also a second PCIe 5.0 M.2 slot and the VRM has been upgraded with 105A powerstages from the 60A models used by the Elite AX but really that's going to be of benefit for very few people.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-12.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-12-jpg)\n\nPerhaps the bigger problem for the Aorus Master is that for the same price the Asus ROG Strix X670E-E Gaming and Asrock X670E Taichi are better equipped. Both boards wire in their primary and secondary PCIe x16 slots to the CPU for PCIe 5.0 bandwidth, the E Gaming is the most affordable X670 motherboard to provide three PCIe 5.0 enabled M.2 slots while the Taichi supports USB4 and eight SATA ports.\n\nFrankly, picking between the Asus ROG Strix X670E-E Gaming and Asrock X670E Taichi is difficult, they're both excellent boards, albeit mighty expensive at $500, but they're equally good in our opinion.\n\n$700: Extreme X670E Motherboards\n--------------------------------\n\nIn the ~$700 segment we have the [Asus ROG Crosshair X670E Hero](https://www.amazon.com/ASUS-ROG-X670E-Motherboard-Front-Panel/dp/B0BDTN8SNJ/?tag=httpwwwtechsp-20) at $680, the [MSI MEG X670E ACE](https://www.amazon.com/MSI-X670E-Gaming-Motherboard-Wi-Fi/dp/B0B6Q4X5NF/?tag=httpwwwtechsp-20) and [Gigabyte X670E Aorus Xtreme](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fgigabyte-x670e-aorus-xtreme%2Fp%2FN82E16813145404) at $700. The Aorus Xtreme kind of suffers the same fate as the Aorus Master, it just doesn't do anything special to justify the price, it's certainly a nice motherboard, but the competing MSI and Asus boards just offer more.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-13.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-13-jpg)\n\nFor some reason Gigabyte spent their PCIe 5.0 budget on the M.2 drives, limiting the PCIe slot support to a single x16 slot. So while we guess four PCIe 5.0 M.2 slots is nice, we'd rather have the flexibility of having more PCIe slots.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-14.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-14-jpg)\n\nThe Crosshair Hero, for example, offers two PCIe 5.0 x16 slots, with two onboard PCIe 5.0 M.2's as well as a PCIe 5.0 expansion card supporting an additional M.2 slot. Meanwhile, the MSI ACE packs an impressive three PCIe 5.0 x16 slots capable of a PCIe 5.0 x8/x8/x4 configuration, and a single onboard PCIe 5.0 M.2 slot along with a PCIe 5.0 expansion card supporting an additional two M.2 slots, providing half a dozen M.2's in total.\n\nThe ACE also packs a possible 17 USB 3.2 ports while the Crosshair Hero provides USB4 support. For us though the fact that you get 10 Gbit LAN with the ACE is a nice bonus, and although the Aorus Xtreme also includes 10 Gbit LAN, it falls short when it comes to USB and PCIe support in our opinion.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-22.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-22-jpg)\n\nWe believe the MSI MEG X670E ACE is the best option in this price segment thanks to its superior PCIe configuration, M.2 support, USB support when compared to the Aorus Xtreme and network support when compared to the Crosshair Hero.\n\n$1,000: Best Super Expensive X670E Motherboards\n-----------------------------------------------\n\nFinally we have the super stupid expensive motherboards, the [Asus ROG Crosshair X670E Extreme](https://www.amazon.com/ASUS-ROG-X670E-Motherboard-Front-Panel/dp/B0BFBRPBF5/?tag=httpwwwtechsp-20) at $1,000 and the 'we don't care at this point' [MSI MEG X670E Godlike](https://www.amazon.com/MSI-X670E-GODLIKE-Gaming-Motherboard/dp/B0B94XN488/?tag=httpwwwtechsp-20) at $1,300.\n\nIf for some reason $700 isn't crazy enough for an AM5 motherboard, Asus and MSI have you covered. The Godlike is an awesome looking motherboard, but we're not sure what it offers over the ACE, it costs $500 more, an 86% price hike, we're just not sure why.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-16.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-16-jpg)\n\nThe I/O panel features one less USB Type-C and one less Type-A and for that it picks up a 2.5 Gbit LAN connection. Other than that the PCIe and M.2 configuration are the same, so very good, but the same as a $700 MSI board.\n\nThe only real difference between the ACE and Godlike is the VRM, and the ACE already packs an overkill VRM. That being the case, we're not sure what you could say about the Godlike's 24 105A powerstage vcore. We can't explain why this board has the power delivery for half a dozen Ryzen 9 processors, but it does.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-21.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-21-jpg)\n\nThe Godlike isn't worth the $300 premium it commands over the Crosshair Extreme, but then it's not worth the $600 premium over the ACE either.\n\nLikewise, the Crosshair Extreme isn't worth $300 over the ACE. At the end of the day, if you want the most extreme X670E motherboard for the sake of bragging rights or whatever, either of these motherboards will work, they're equally ridiculous.\n\nWhat We Learned\n---------------\n\nThere you have it, VRM thermals for basically every X670 and X670E motherboard on the market, along with our own breakdown and recommendations for each price point. Let's quickly recap our picks...\n\nProcessor Model\n\nPrice\n\nvcore VRM\n\nPCIe Gen 5.0\n\nPCIe Gen 4.0/3.0\n\nM.2 Gen 5.0\n\nM.2 Gen 4.0/3.0\n\nUSB 4.0 Ports\n\nUSB 3.2 Ports\n\nUSB 2.0 Ports\n\nSATA III\n\nWi-Fi\n\nLAN\n\nAsrock X670E PG Lightning\n\n$260\n\n14, 70A\n\n1\n\n3\n\n1\n\n3\n\n\\-\n\n13\n\n6\n\n4\n\n\\-\n\n2.5G\n\nGigabyte X670 Gaming X\n\n$270\n\n16, 70A\n\n0\n\n4\n\n1\n\n3\n\n\\-\n\n14\n\n8\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nMSI Pro X670-P WiFi\n\n$280\n\n16, 80A\n\n0\n\n4\n\n1\n\n3\n\n\\-\n\n13\n\n4\n\n6\n\nWi-Fi 6E\n\n2.5G\n\nAsrock X670E Pro RS\n\n$280\n\n14, 60A\n\n1\n\n2\n\n1\n\n4\n\n\\-\n\n11\n\n8\n\n6\n\nWi-Fi 6E\n\n2.5G\n\nAsus Prime X670-P WiFi\n\n$290\n\n12, 60A\n\n0\n\n4\n\n1\n\n3\n\n\\-\n\n13\n\n4\n\n6\n\nWi-Fi 6E\n\n2.5G\n\nGigabyte X670 Aorus Elite AX\n\n$290\n\n16, 70A\n\n0\n\n3\n\n1\n\n3\n\n\\-\n\n14\n\n8\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nAsrock X670E Steel Legend\n\n$300\n\n16, 60A\n\n1\n\n2\n\n1\n\n3\n\n\\-\n\n13\n\n8\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nAsus TUF Gaming X670E-Plus WiFi\n\n$330\n\n14, 70A\n\n1\n\n2\n\n1\n\n3\n\n\\-\n\n13\n\n6\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nAsus Prime X670E-Pro WiFi\n\n$350\n\n14, 70A\n\n1\n\n2\n\n2\n\n2\n\n\\-\n\n13\n\n6\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nAsus ROG Strix X670E-A Gaming\n\n$420\n\n16, 70A\n\n1\n\n2\n\n2\n\n2\n\n\\-\n\n13\n\n6\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nAsus ROG Strix X670E-F Gaming\n\n$440\n\n16, 90A\n\n1\n\n2\n\n2\n\n2\n\n\\-\n\n13\n\n6\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nAsus ROG Strix X670E-I Gaming WiFi\n\n$460\n\n10, 110A\n\n1\n\n0\n\n1\n\n1\n\n2\n\n9\n\n6\n\n2\n\nWi-Fi 6E\n\n2.5G\n\nMSI MPG X670E Carbon WiFi\n\n$480\n\n18, 90A\n\n2\n\n1\n\n2\n\n2\n\n\\-\n\n13\n\n6\n\n6\n\nWi-Fi 6E\n\n2.5G\n\nAsus ROG Strix X670E-E Gaming\n\n$500\n\n18, 110A\n\n2\n\n1\n\n3\n\n1\n\n\\-\n\n16\n\n6\n\n4\n\nWi-Fi 6E\n\n2.5G\n\nGigabyte X670E Aorus Master\n\n$500\n\n16, 105A\n\n1\n\n2\n\n2\n\n2\n\n\\-\n\n15\n\n6\n\n6\n\nWi-Fi 6E\n\n2.5G\n\nAsrock X670E Taichi\n\n$500\n\n24, 105A\n\n2\n\n0\n\n1\n\n3\n\n2\n\n13\n\n4\n\n8\n\nWi-Fi 6E\n\n2.5G\n\nAsus ROG Crosshair X670E Gene\n\n$510\n\n16, 110A\n\n1\n\n1\n\n2\n\n1\n\n2\n\n9\n\n6\n\n5\n\nWi-Fi 6E\n\n2.5G\n\nAsus ROG Crosshair X670E Hero\n\n$680\n\n18, 110A\n\n2\n\n1\n\n2\n\n2\n\n2\n\n15\n\n6\n\n6\n\nWi-Fi 6E\n\n2.5G\n\nMSI MEG X670E ACE\n\n$700\n\n22, 90A\n\n3\n\n0\n\n3\n\n3\n\n\\-\n\n17\n\n4\n\n6\n\nWi-Fi 6E\n\n10G\n\nGigabyte X670E Aorus Xtreme\n\n$700\n\n18, 105A\n\n1\n\n2\n\n4\n\n0\n\n\\-\n\n13\n\n8\n\n6\n\nWi-Fi 6E\n\n10G\n\nAsus ROG Crosshair X670E Extreme\n\n$1,000\n\n20, 110A\n\n2\n\n1\n\n4\n\n1\n\n2\n\n16\n\n4\n\n6\n\nWi-Fi 6E\n\n2.5G + 10G\n\nMSI MEG X670E Godlike\n\n$1,300\n\n24, 105A\n\n3\n\n0\n\n3\n\n3\n\n\\-\n\n15\n\n4\n\n8\n\nWi-Fi 6E\n\n2.5G + 10G\n\nThe best value X670 motherboards include the [Asrock X670E PG Lightning](https://www.amazon.com/ASRock-X670E-PG-Processors-Motherboard/dp/B0BGPH2LQJ?tag=httpwwwtechsp-20) and [Gigabyte X670 Gaming X](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fp%2F1HD-0002-00216), along with the [Asrock X670E Pro RS](https://www.amazon.com/ASRock-X670E-PRO-RS-Motherboard/dp/B0BGPCNSGZ/?tag=httpwwwtechsp-20) and [Asrock X670E Steel Legend](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fasrock-x670e-steel-legend%2Fp%2FN82E16813162070).\n\nThe best mid-range options which sadly cost ~$500 include the [MSI MPG X670E Carbon WiFi](https://www.amazon.com/MSI-X670E-Carbon-Gaming-Motherboard/dp/B0B6Q23SPC/?tag=httpwwwtechsp-20) and [Asus ROG Strix X670E-E Gaming](https://www.amazon.com/ASUS-ROG-Motherboard-Q-Release-Q-Latch/dp/B0BDTHQTJV/?tag=httpwwwtechsp-20), both are very good, along with the [Asrock X670E Taichi](https://www.amazon.com/ASRock-X670E-Support-Processors-Motherboard/dp/B0BGPF7K2P/?tag=httpwwwtechsp-20).\n\nIn the same price range, the [Asus ROG Strix X670E-I Gaming WiFi](https://www.amazon.com/ASUS-STRIX-X670E-I-GAMING-WIFI/dp/B0BDTVCJF8/?tag=httpwwwtechsp-20) wins the award for the best X670E Mini-ITX motherboard by default, as it's the only one as does the [Asus ROG Crosshair X670E Gene](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fasus-rog-crosshair-x670e-gene%2Fp%2FN82E16813119583R) for the best and only Micro-ATX motherboard.\n\n[~![](https://www.techspot.com/articles-info/2621/images/2023-02-07-image-20.jpg)~](https://www.techspot.com/photos/article/2621-amd-x670-motherboards/#2023-02-07-image-20-jpg)\n\nThe best high-end X670E motherboard is simply the [MSI MEG X670E ACE](https://www.amazon.com/MSI-X670E-Gaming-Motherboard-Wi-Fi/dp/B0B6Q4X5NF/?tag=httpwwwtechsp-20). The stupid expensive [Asus ROG Crosshair X670E Extreme](https://www.amazon.com/ASUS-ROG-X670E-Motherboard-Front-Panel/dp/B0BFBRPBF5?tag=httpwwwtechsp-20) and [MSI MEG X670E Godlike](https://www.amazon.com/MSI-X670E-GODLIKE-Gaming-Motherboard/dp/B0B94XN488/?tag=httpwwwtechsp-20) are excellent motherboards, but we can't justify the asking prices, especially in the case of the Godlike.\n\nThese are great news to share: there are no bad X670/X670E motherboards. Surely prices might be a bit hard to swallow, but there are no duds, and that's a rare thing when reviewing an entire motherboard series. We hope you found this useful and expect a similar piece covering B650 motherboards.\n\n##### Shopping Shortcuts:\n\n*   Asrock X670E PG Lightning on [Amazon](https://www.amazon.com/ASRock-X670E-PG-Processors-Motherboard/dp/B0BGPH2LQJ?tag=httpwwwtechsp-20)\n*   Asrock X670E Pro RS on [Amazon](https://www.amazon.com/ASRock-X670E-PRO-RS-Motherboard/dp/B0BGPCNSGZ/?tag=httpwwwtechsp-20)\n*   Asrock X670E Steel Legend on [Newegg](https://click.linksynergy.com/deeplink?id=zaOYbDCLUdk&mid=44583&murl=https%3A%2F%2Fwww.newegg.com%2Fasrock-x670e-steel-legend%2Fp%2FN82E16813162070)\n*   MSI MPG X670E Carbon WiFi on [Amazon](https://www.amazon.com/MSI-X670E-Carbon-Gaming-Motherboard/dp/B0B6Q23SPC/?tag=httpwwwtechsp-20)\n*   Asus ROG Strix X670E-E Gaming on [Amazon](https://www.amazon.com/ASUS-ROG-Motherboard-Q-Release-Q-Latch/dp/B0BDTHQTJV/?tag=httpwwwtechsp-20)\n*   MSI MEG X670E ACE on [Amazon](https://www.amazon.com/MSI-X670E-Gaming-Motherboard-Wi-Fi/dp/B0B6Q4X5NF/?tag=httpwwwtechsp-20)\n*   AMD Ryzen 9 7950X on [Amazon](https://www.amazon.com/AMD-7950X-32-Thread-Unlocked-Processor/dp/B0BBHD5D8Y/?tag=httpwwwtechsp-20)"
    },
    {
        "url": "https://www.tomshardware.com/features/x670-motherboard-overview",
        "content": "AMD X670/B650 Motherboard Overview: 20-Plus Motherboards for AM5\nJoe Shields\n ~![AMD X670/B650 Motherboard Overview](https://cdn.mos.cms.futurecdn.net/rpmfNUEyBaNHgJMpEmeqLP-320-80.jpg)~\n\n~~ ~~ ~~\n\n(Image credit: AMD, Asus, ASRock, Gigabyte, MSI)\n\n**4/17/2023 Update:**  \nSince the initial launch of AMD's first Ryzen 7000  motherboards, there have been plenty of complaints from PC builders (and us) that AMD's latest motherboards [cost too much](https://www.tomshardware.com/news/why-amds-ryzen-7000-and-motherboards-cost-so-damn-much). But recently, a few B650M motherboards launched [in the $125 range](https://www.tomshardware.com/news/more-dollar125-amd-am5-motherboards-are-coming), and even more-affordable [A620 boards](https://www.tomshardware.com/news/asus-amd-a620-motherboards-ryzen-7000) are also on the way (though they lack PCIe 5.0 and official overclocking support). Be sure to check out our [best motherboards](https://www.tomshardware.com/best-picks/best-motherboards) page, as we are in the process of testing and reviewing some of AMD's more affordable motherboard options.\n\nLining up with [AMD’s Ryzen 7000 CPU announcements](https://www.tomshardware.com/news/amd-zen-4-ryzen-7000-release-date-specifications-pricing-benchmarks-all-we-know-specs), many motherboard partners are showing off their new X670E/X670-based motherboards, featuring the new AM5 socket, to go along with the new Zen 4 chips. The new motherboards come with a slew of updates and improvements to support the new CPU platform. This includes moving from DDR4 to DDR5 (no DDR4 options, unlike Intel), a shift from PCIe 4.0 to PCIe 5.0, and upgraded power delivery to support the socket capable of using up to 230W.\n\nI look forward to all the new hardware bits and functionality, but I get most excited about the new designs board partners come up with. Over the coming months, we’ll review many of these boards, with the best models earning spots on our best motherboards page.\n\nUntil we get started with reviews, we’ve created a list of Ryzen 7000 motherboards, with as much information directly from partners as possible. Many details, including the all-important price, will arrive later. So there’s some speculation on our end below. We’ll provide everything we have regarding official facts and update the information here as we get it.\n\nAMD’s X670 Chipset: AM5 goes LGA, PCIe 5.0 and DDR5\n---------------------------------------------------\n\nJust as with our [Z690 overview article](https://www.tomshardware.com/features/intel-z690-motherboard-and-chipset-overview) earlier this year, when we started this one, AMD had not released the full details of the X670 chipsets. But what we do know is AMD has moved away from the PGA (Pin Grid Array) socket to an LGA (Land Grid Array) socket, like Intel processors. The new socket contains 1,718 pins, 18 more than Intel’s LGA 1700 socket for its Z6x0 motherboards and Alder Lake processors. The good news is that AM4-compatible cooling will fit the AM5 motherboards. Many mounting kits work natively, though some will need new ones for best results. Reach out to the company that made your cooler to confirm compatibility.\n\nAlong with the flagship-class X670E chipset, AMD is also releasing X670 (no “E”), B650E and B650 chipsets. X670E supports all the new bells and whistles, including PCIe 5.0 slots and storage, along with AMD EXPO memory technology (essentially an AMD-specific version of Intel’s XMP). X670, on the other hand, supports EXPO, but only PCIe 5.0 on the NVMe storage (not the PCIe slot). The other chipsets, B650E and B650, offer users a less-expensive path into the new AM5 platform. The “E” variant has comprehensive support for PCIe Gen 5 (slot and NVMe storage), while the ‘base’ X650 chipset only supports PCIe 5.0 on storage/NVMe. Both chipsets support overclocking the processor and memory.\n\n~![AMD X670/B650](https://vanilla.futurecdn.net/cyclingnews/media/img/missing-image.svg)~\n\n(Image credit: Tom's Hardware)\n\nThe B650E motherboards target the mid-range to higher ‘budget’ options, so there will likely be some pricing overlap between the higher tier B650E and X670, as they share some of the same internals, including PCIe redrivers and the necessary space to support them. While most motherboard partners haven’t disclosed pricing, AMD did mention that AM5 motherboards will be available for as low as $125. However, we imagine this is likely the MSRP of the least expensive B650 motherboard(s). That said, we expect a price increase compared to X570 and perhaps even Z690, regardless of the chipset tier. It’s nice to see graphics cards coming down in price, but getting into a new DDR5 platform will cost you.\n\n~![AMD X670/B650](https://vanilla.futurecdn.net/cyclingnews/media/img/missing-image.svg)~\n\n(Image credit: Tom's Hardware)\n\nAlong with the jump to DDR5, AMD is also releasing AMD EXPO (EXtended Profiles for Overclocking) memory technology, a one-click overclocking profile for Ryzen 7000 series memory. Similar to integrated XMP profiles for Intel, you’ll have EXPO profiles to select in the BIOS to run your kit at the rated speeds. AMD partnered with several memory manufacturers, including ADATA, Corsair, Geil, G.Skill and Kingston to help bring DDR5 memory kits to the market with the new features. According to AMD, upon launch on September 27th, you should see at least 15 kits of DDR5 with AMD EXPO functionality at speeds up to DDR5-6400. We’ve already covered kits from [G.Skill](https://www.tomshardware.com/news/gskill-unveils-amd-expo-certified-ddr5-ram-for-ryzen-7000-cpus) and [TeamGroup](https://www.tomshardware.com/news/teamgroup-launches-sweet-spot-ddr5-6000-for-ryzen-7000).\n\nGet Tom's Hardware's best news and in-depth reviews, straight to your inbox.\n\nOne of the more unique features of the X670E boards is their dual PCHs. The chipset (actually a chipset, defined as multiple chips) uses two Promontory 21 (PROM21) chips. Instead of exclusive access to the CPU for each, the two chips connect to each other through four PCIe 4.0 lanes, which then connect to the CPU directly, sporting the same PCIe 4.0 x4 bandwidth as X570 for DMI. Combined, the chipset provides three PCIe 4.0 x4 interfaces (12 lanes total) and eight PCIe 3.0, the latter reserved for slower connectivity like networking. Board partners have the flexibility to configure the PCIe 3.0 to SATA ports, which yields a mix and match of six SATA plus two PCIe (x4 + x4).\n\nA benefit of using a multi-chip configuration (both 7W TDP, note), is that they can be spread out and cooled passively, forgoing the fans that many despised (few with good reason, as they weren’t noisy) on the first batch of X570 motherboards. Thankfully, we haven’t seen any chipset fans on Micro ATX or larger boards, but we do expect to see them used with high-end Mini-ITX motherboards since real estate is so limited on those tiny boards. Check out [our article](https://www.tomshardware.com/news/amds-multi-chiplet-x670-x670e-strategy) from a few months back for more detailed information. AMD hasn’t released an official chipset diagram at this time, but we have one for the Aorus Master, which gives you an example of how things can be split up.\n\n![AMD X670/B650](https://cdn.mos.cms.futurecdn.net/W9vhpjfWvhStYnykrUuu8F-320-80.jpg)\n\n(Image credit: Gigabyte)\n\nOn the USB front, the chipset offers quite a bit of native USB connectivity. X670/X670E supports up to eight USB 3.2 Gen 2 (10 Gbps) ports and another four ports that can be configured as two USB 3.2 Gen 2x2 (20 Gbps) ports. If that isn’t enough, the chipset also supports up to 12 more USB 2.0 ports.\n\nSome high-end boards support USB Power Delivery (PD) and output up to 60W at 20V/3A. Not only can you fast charge your smartphone with these ports, but larger devices like tablets and some laptops, too. To support that much power, you’ll need to plug a spare 6-pin PCIe connector to plug into the board. Otherwise, you’ll be limited to the 20V/1.5A and 30W. For the midrange B650 chipset, just one of the PROM21 chips is used. On some boards, you’ll find [USB 4](https://www.tomshardware.com/news/usb-4-faq,38766.html) support via an ASMedia ASM4242 controller, which outputs two USB 4 ports from four PCIe 4.0 lanes via the CPU, while also supporting DisplayPort v1.4 (thus video) through the interface.\n\nMoving to networking, there isn’t too much of a change here, especially when compared to the updated B550 boards (or Intel Z690), which added 2.5 GbE port(s), with high-end boards using up to 10 GbE. The new chipset also includes integrated Wi-Fi 6E, akin to Intel’s CNVi implementation, which is included on most boards.\n\nHere’s a look at how X670 compares with AMD’s previous mainstream flagship chipsets. You’ll notice some question marks remain; remember that we don’t have an official chipset diagram from AMD. We’ll update any information below once we have official information from AMD.\n\nAMD X670E/X670, B650E/B650 and X570 Chipset Specifications\n----------------------------------------------------------\n\nSwipe to scroll horizontally\n\nFeature\n\nX670E\n\nX670\n\nB650E/B650\n\nX570\n\nSocket\n\nAM5\n\nAM5\n\nAM5\n\nAM4\n\nPCIe x.0 Lanes (CPU)\n\n16 / 4 (PCIe 5.0) 4 (PCIe 4.0)\n\n16 / 4 (PCIe 5.0) 4 (PCIe 4.0)\n\n16 / 8 (PCIe 4/5.0)\n\n16/24 (PCIe 4.0)\n\nPCIe Configuration\n\nx16, x8/x8, x8/x4/x4\n\nx16, x8/x8, x8/x4/x4\n\nx16, x8/x8, x8/x4/x4\n\nx16, x8/x8, x8/x4/x4\n\nUSB 3.2 (Gen2x2/2/1)\n\n2/8\n\n2/8\n\nRow 3 - Cell 3\n\n1/4\n\nTotal USB\n\n22\n\n22\n\nRow 4 - Cell 3\n\n11\n\nSATA 3.0 Ports\n\n6\n\n6\n\nRow 5 - Cell 3\n\n4\n\nHSIO Lanes (CPU + PCH)\n\n40??\n\n40??\n\n28??\n\n40\n\nMemory Channels (Max. Supported Speed)\n\nDual (DDR5 5200)\n\nDual (DDR5 5200)\n\nDual (DDR5 5200)\n\nDual (DDR4 3200)\n\nIntegrated Wi-fi 6E\n\nYes (Wi-Fi 6E)\n\nYes (Wi-Fi 6E)\n\nYes (Wi-Fi 6E)\n\nN/A\n\nDMI\n\n4.0(x4)\n\n4.0(x4)\n\n4.0(x4)\n\n4.0(x4)\n\nOverclocking\n\nYes\n\nYes\n\nYes\n\nYes\n\nTDP\n\n~7+7W\n\n~7+7W\n\n~7W\n\n11W\n\nAM5 CPUs\n--------\n\n![AMD X670/B650](https://cdn.mos.cms.futurecdn.net/ksmC9rZvezrpkJ5PDYYQUE-320-80.jpg)\n\n(Image credit: Tom's Hardware)\n\nWe’ve already covered the Zen 4 [Ryzen 7000 details](https://www.tomshardware.com/news/amd-zen-4-ryzen-7000-release-date-specifications-pricing-benchmarks-all-we-know-specs), so we won’t get into all of the CPU nitty gritty here and keep it high level. AMD will release four new Zen 4 Ryzen series (Code name “Raphael”) processors at launch. Up top is the 16-core $699 Ryzen 9 7950X flagship, followed by the 12-core $549 Ryzen 9 7900X, a $399 8-core Ryzen 7 7700X, and finally, the budget chip of the group, the $299 6-core Ryzen 5 7600X. Pricing is solid overall, with the Ryzen 7 7700X the only processor increasing in price, by $100, over the last-generation Ryzen 7 5700X it replaces. The 7950X is $100 _less_ than the 5950X’s launch price, while the 7900X and 7600X cost the same as the 5700X and 5600X launch prices. While that’s a positive across most SKUs, the real cost increases will almost certainly come from the motherboard and the shift to DDR5. It does though, seem likely that [DDR5 prices will continue to fall](https://www.tomshardware.com/news/ddr5-prices-to-drop-rapidly-2023), especially on lower-end kits.\n\n![AMD X670/B650](https://cdn.mos.cms.futurecdn.net/FysvH5bkPFxCcprxfGBYXE-320-80.jpg)\n\n(Image credit: Tom's Hardware)\n\nThe new CPUs are built on TSMC’s 5nm process node for the Core Compute Die (CCD) and a 6nm process for the I/O die (IOD). Although the core/thread counts remain the same, Zen 4 also doubles the L2 cache (L3 remains the same). Along with the clock speed increase, this helps with overall performance. With the new architecture though, TDP and power goes up. The Ryzen 9 chips have a TDP of 170W, with peaks (PBP/MTP) allowed up to 230W, a healthy increase from Zen 3. The Ryzen 7 7700X and 7600X both sport 105W TDPs, but their PBP/MTP power limit is currently unknown. In short, you’ll probably need a good cooling solution to get the most out of these chips (same as Intel), and you may need to spring for a new power supply.\n\n~![AMD X670/B650](https://vanilla.futurecdn.net/cyclingnews/media/img/missing-image.svg)~\n\n(Image credit: Tom's Hardware)\n\nThe good news is that with the power increase comes a significant performance uplift. According to AMD, the processors achieve up to 13% improvement in IPC (Instructions Per Clock). Along with the notable IPC increase, AMD also raised the ceiling on clock speeds, boosting up to a blazing 5.7 GHz on two cores. Some simple napkin math results reveal around a 29% improvement in single-threaded performance over Zen 3. AMD also notes up to 45% more performance in multi-threaded applications. AMD also claims it’s 11% faster in games, 44% faster for compute functionality, and 47% greater efficiency than the Intel Core i9-12900K. Of course, these chips will obviously be competing with [13th Gen Raptor Lake](https://www.tomshardware.com/news/intel-13th-gen-raptor-lake-release-date-specifications-pricing-benchmarks-all-we-know-specs) chips, like the [Core i9-13900K](https://www.tomshardware.com/news/core-i9-13900k-early-review-shows-big-gains-over-core-i9-12900k). The new AMD processors also support AVX-512 and, for the first time in a long time, include integrated graphics based on the RDNA 2 architecture. Note though, that the integrated graphics here are basic, meant primarily to handle displaying the desktop, not running games.\n\nUnlike Intel, AMD chose to go all in with DDR5 and so does not support DDR4 on its new platform. Since DDR5 is available in greater volume and prices are coming down (though still a lot higher than DDR4), this was arguably a good choice on AMD’s part. The highest in-spec frequency for the existing AM5 SKUs is DDR5-5200. But AMD did share that DDR5-6000 will be the sweet spot for Zen 4.\n\nX670 (and rumored B650) Motherboards: The Full List (So Far)\n------------------------------------------------------------\n\nWith the chipset details out of the way, we’ve provided a list of all X670 and X650 motherboards kown so far below, doing our best to ignore unsubstantiated rumors and leaks. As usual, not all partners responded or had updated web pages in time for publication, so there's a strong chance that some things will change. We’ll break things out on the following pages and offer some thoughts on the respective launch lineups after. Unfortunately, pricing is an essential piece of information that no vendors have provided yet. But we’ve filled in the tables with what data we have. Any models listed in **bold** are confirmed through the board partner, while any that are not bold and _italicized_ (most B650), are unconfirmed but heavily speculated around the web.\n\nX670/B650 Motherboard Product Stack by Partner\n----------------------------------------------\n\nSwipe to scroll horizontally\n\nModel\n\nSize\n\nPrice (MSRP)\n\nBuy\n\nASRock X670E Taichi Carrara\n\nATX\n\n?\n\nNot Available\n\nASRock X670E Taichi\n\nATX\n\n?\n\nNot Available\n\nASrock X670E Steel Legend\n\nATX\n\n?\n\nNot Available\n\nASRock X670E Pro RS\n\nATX\n\n?\n\nNot Available\n\nASRock X670E PG Lightning\n\nATX\n\n?\n\nNot Available\n\nASRock B650E Steel Legend\n\nATX\n\n?\n\nNot Available\n\nASRock B650E ITX WiFi\n\nITX\n\n?\n\nNot Available\n\nASRock B650E Phantom Gaming Riptide\n\nATX\n\n?\n\nNot Available\n\nASRock B650E Phantom Gaming-ITX/AX\n\nITX\n\n?\n\nNot Available\n\nASRock B650 Phantom Gaming velocita\n\nATX\n\n?\n\nNot Available\n\nASRock B650M Phantom Gaming Riptide\n\nmATX\n\n?\n\nNot Available\n\nASRock B650M-C\n\nmATX\n\n?\n\nNot Available\n\nASRock B650-C\n\nATX\n\n?\n\nNot Available\n\nASRock B650 LiveMixer\n\nATX\n\n?\n\nNot Available\n\nASRock B650 PG Lightning\n\nATX\n\n?\n\nNot Available\n\nAsus ROG Crosshair X670E Extreme\n\nE-ATX\n\n?\n\nNot Available\n\nAsus ROG Crosshair X670E Hero\n\nATX\n\n?\n\nNot Available\n\nAsus ROG Crosshair X670E Gene\n\nmATX\n\n?\n\nNot Available\n\nAsus ROG Strix X670-E WIFI Gaming\n\nATX\n\n?\n\nNot Available\n\nAsus Prime X670E-Pro WiFi\n\nATX\n\n?\n\nNot Available\n\nAsus TUF Gaming X670E-Plus WiFi\n\nATX\n\n?\n\nNot Available\n\nAsus ProArt X670E-Creator WiFi\n\nATX\n\n?\n\nNot Available\n\nAsus ROG Strix B650E-E Gaming Wifi\n\nATX\n\n?\n\nNot Available\n\nAsus ROG Strix B650-A Gaming Wifi\n\nATX\n\n?\n\nNot Available\n\nAsus TUF-Gaming B650-Plus Wifi\n\nATX\n\n?\n\nNot Available\n\nAsus TUF-Gaming B650-Plus\n\nmATX\n\n?\n\nNot Available\n\nAsus TUF-Gaming B650M-Plus Wifi\n\nmATX\n\n?\n\nNot Available\n\nAsus TUF-Gaming B650M-Plus\n\nATX\n\n?\n\nNot Available\n\nAsus Prime B650-Plus\n\nATX\n\n?\n\nNot Available\n\nBiostar X670E Valkyrie\n\nATX\n\n$599\n\nNot Available\n\nEVGA\n\n?\n\n?\n\nNot Available\n\nGigabyte X670E AORUS Extreme\n\nE-ATX\n\n?\n\nNot Available\n\nGigabyte X670E AORUS Master\n\nE-ATX\n\n?\n\nNot Available\n\nGigabyte X670 Aorus Pro AX\n\nATX\n\n?\n\nNot Available\n\nGigabyte X670 Aorus Elite AX\n\nATX\n\n?\n\nNot Available\n\nMSI MEG X670E Godlike\n\nE-ATX\n\n$1,299.99\n\nNot Available\n\nMSI MEG X670E Ace\n\nE-ATX\n\n$699.99\n\nNot Available\n\nMSI MPG X670E Carbon\n\nATX\n\n$479.99\n\nNot Available\n\nMSI Pro X670-P WiFI\n\nATX\n\n$289.99\n\nNot Available;\n\nMSI Pro X670-P\n\nATX\n\n$269.99?\n\nNot Available\n\nMSI B650 Carbon WiFi\n\nATX\n\n?\n\nNot Available\n\nMSI B650-Edge WIFI\n\nATX\n\n?\n\nNot Available\n\nMSI B650I Edge WIFI\n\nITX\n\n?\n\nNot Available\n\nMSI B650 Tomahawk WIFI\n\nATX\n\n?\n\nNot Available\n\nMSI B650M Mortar WIFI\n\nmATX\n\n?\n\nNot Available\n\nMSI Pro B650-P WIFI\n\nATX\n\n?\n\nNot Available\n\nMSI Pro B650M-A WIFI\n\nmATX\n\n?\n\nNot Available\n\nNZXT N7 X670E?\n\nATX?\n\n?\n\nNot Available\n\n**MORE:** [**Best Motherboards**](https://www.tomshardware.com/best-picks/best-motherboards)\n\n**MORE:** [**How To Choose A Motherboard**](https://www.tomshardware.com/reviews/motherboard-buying-guide,5682.html)\n\n**MORE:** [**All Motherboard Content**](https://www.tomshardware.com/pc-components/motherboards)\n\nJoe Shields is a Freelance writer for Tom’s Hardware US. He reviews motherboards.\n\n##### Most Popular"
    }
]